[
  {
    "id": 1,
    "date": "31.01.2024",
    "time": "23:37",
    "title": "Application description",
    "content": "Web Blog Post is an simple app for reading, writing, editing and deleting blog posts. Web Blog Post is built using Node.js and Express.\r\n\r\n-- Key features and functionalities of the program--\r\nImported Modules:\r\nThe program imports several modules, including express, path, fs/promises for asynchronous file operations, body-parser for parsing request bodies, and ejs as the view engine.\r\n\r\nExpress Setup:\r\nAn Express application is created, and middleware like express.static and body-parser is used to handle static files and parse JSON and URL-encoded data in requests.\r\n\r\nView Engine Setup:\r\nEJS (Embedded JavaScript) is set as the view engine for rendering dynamic HTML templates.\r\n\r\nRouting:\r\nVarious routes are defined using app.get and app.post for handling different HTTP requests.\r\nRoutes include home (/ and /home), creating a new post (/newpost), searching (/search), browsing posts (/browse), retrieving post content (/getPostContent/:id), submitting a new post (/submit), deleting a post (/deletePost/:id), updating post views (/updateViews/:id), and editing a post (/editPost/:id).\r\n\r\nFile Operations:\r\nThe program reads and writes posts data from/to a JSON file (posts.json) asynchronously using fs/promises.\r\nThe posts.json file contains an array of post objects, each with properties like id, date, time, title, content, author, email, editable, and views.\r\n\r\nError Handling Middleware:\r\nA custom error-handling middleware is implemented to log errors and send a 500 Internal Server Error response.\r\n\r\nRendering Views:\r\nViews are rendered using EJS templates located in the views directory.\r\nThe res.render method is used to render HTML views and pass data to the templates.\r\n\r\nUtility Functions:\r\nThere is a utility function getDate to generate a formatted date and time string for post submissions.\r\n\r\nListening for Requests:\r\nThe Express application listens on a specified port (3000 in this case) for incoming HTTP requests.\r\n\r\nOverall, the program is a basic web application with CRUD (Create, Read, Update, Delete) operations for posts, user interactions, and dynamic rendering of HTML views using the EJS templating engine.",
    "author": "ToniM",
    "email": "t.mertanen@hotmail.com",
    "editable": "off",
    "views": 24
  }
]